Revit 2024 API
ConduitSizeSettings.CreateConduitStandardTypeFromExisingStandardType Method
 Creates one conduit standard type with the new name and assign the conduit sizes to it from the existing standard type.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2017
Syntax
C#
public bool CreateConduitStandardTypeFromExisingStandardType(
	Document pADoc,
	string newStandardName,
	string existingStandardName
)
Visual Basic
Public Function CreateConduitStandardTypeFromExisingStandardType ( _
	pADoc As Document, _
	newStandardName As String, _
	existingStandardName As String _
) As Boolean
Visual C++
public:
bool CreateConduitStandardTypeFromExisingStandardType(
	Document^ pADoc,
	String^ newStandardName,
	String^ existingStandardName
)
Parameters
pADoc
Type: Autodesk.Revit.DB.Document
 The document.
newStandardName
Type: System.String
 The new conduit standard name.
existingStandardName
Type: System.String
 The existing conduit standard name.
Return Value
 True if creating success; otherwise false.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  The conduit standard name already exists. -or- The conduit standard name does not exist.
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
ConduitSizeSettings Class
Autodesk.Revit.DB.Electrical Namespace